app/Models/AdminModel.php

    public function getConductedDemo()
    {

        return $this->db->table('free_demo_table')->where('Conducted_Demo', 'Y')->get()->getResult();
---
SELECT *
FROM `free_demo_table`
WHERE `Conducted_Demo` = 'Y'

    public function getPendingDemo()
    {
        return $this->db->table('free_demo_table')->where('Conducted_Demo', 'N')->get()->getResult();
---
SELECT *
FROM `free_demo_table`
WHERE `Conducted_Demo` = 'N'

    public function getPendingDemoList()
    {
        return $this->db->table('free_demo_table')
            ->where('Conducted_Demo', 'N')
            ->where('Reshedule_date', null)
            ->get()
            ->getResult();
---
SELECT *
FROM `free_demo_table`
WHERE `Conducted_Demo` = 'N'
AND `Reshedule_date` IS NULL

    public function getConductedDemoStatus()
    {
        return $this->db->table('free_demo_table')->where('AssignTecher_id >', 0)->get()->getResult();
---
SELECT *
FROM `free_demo_table`
WHERE `AssignTecher_id` > 0

    public function Paymentstatus()
    {
        return $this->db->table('register')->where('Payment_status', 'Y')->get()->getResult();
---
SELECT *
FROM `register`
WHERE `Payment_status` = 'Y'

    public function getAllDemoData()
    {
        return $this->db->table('free_demo_table')
            ->select('*')
            ->get()
            ->getResult();
---
SELECT *
FROM `free_demo_table`