app/Models/AdminModel.php

SELECT *
FROM `free_demo_table`
WHERE `Conducted_Demo` = 'N'
---
    public function getConductedDemo()
    {

        return $this->db->table('free_demo_table')->where('Conducted_Demo', 'Y')->get()->getResult();

SELECT *
FROM `register`
WHERE `role` = 'Student'
---
    public function getFacultyrole()
    {

        return $this->db->table('register')->where('role', 'Faculty')->get()->getResult();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `course` = '1'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `course` = '1'
---
 public function getstarcount()
 {
     $totalRatings = $this->db->table('feedback')
            ->selectSum('rating', 'total_ratings')
            ->where('course', '1')
            ->get()
            ->getRowArray();

        // Total number of feedbacks for the faculty
        $feedbackCount = $this->db->table('feedback')
        ->where('course', '1')
        ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '3'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '3'
---
 public function getstarcount1()
 {



         $totalRatings = $this->db->table('feedback')
            ->selectSum('rating', 'total_ratings')
            ->where('sub_course', '3')
            ->get()
            ->getRowArray();

        // Total number of feedbacks for the faculty
        $feedbackCount = $this->db->table('feedback')
        ->where('sub_course', '3')
        ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '5'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '5'
---
 public function getstarcount2()
 {


         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('sub_course', '5')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('sub_course', '5')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '6'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '6'
---
 public function getstarcount3()
 {
         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('sub_course', '6')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('sub_course', '6')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '7'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '7'
---
 public function getstarcount4()
 {
         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('sub_course', '7')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('sub_course', '7')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '8'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '8'
---
 public function getstarcount5()
 {


         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('sub_course', '8')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('sub_course', '8')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `course` = '3'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `course` = '3'
---
 public function getstarcount6()
 {

         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('course', '3')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('course', '3')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `course` = '3'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `course` = '3'
---
 public function getstarcount7()
 {

    $totalRatings = $this->db->table('feedback')
    ->selectSum('rating', 'total_ratings')
    ->where('course', '3')
    ->get()
    ->getRowArray();

    // Total number of feedbacks for the faculty
    $feedbackCount = $this->db->table('feedback')
    ->where('course', '3')
    ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `course` = '2'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `course` = '2'
---
 public function getstarcount8()
 {
         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('course', '2')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('course', '2')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '17'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '17'
---
 public function getstarcount9()
 {


         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('sub_course', '17')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('sub_course', '17')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `sub_course` = '19'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `sub_course` = '19'
---
 public function getstarcount10()
 {



         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('sub_course', '19')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('sub_course', '19')
     ->countAllResults();

SELECT SUM(`rating`) AS `total_ratings`
FROM `feedback`
WHERE `course` = '3'
SELECT COUNT(*) AS `numrows`
FROM `feedback`
WHERE `course` = '3'
---
 public function getstarcount11()
 {

         $totalRatings = $this->db->table('feedback')
         ->selectSum('rating', 'total_ratings')
         ->where('course', '3')
         ->get()
         ->getRowArray();

     // Total number of feedbacks for the faculty
     $feedbackCount = $this->db->table('feedback')
     ->where('course', '3')
     ->countAllResults();

SELECT *
FROM `register`
WHERE `course` = '1'
---
public function getusercount()
{
    $countdata = 0;
    $allData = $this->db->table('register')
        ->where('course', '1')
        ->get()
        ->getResult(); // Change getRow() to getResult()

SELECT *
FROM `register`
WHERE `sub_course` = '3'
---
public function getusercount1()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '3')
        ->get()
        ->getResult(); // Change getRow() to getResult()

SELECT *
FROM `register`
WHERE `sub_course` = '5'
---
public function getusercount2()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '5')
        ->get()
        ->getResult(); // Change getRow() to getResult()

SELECT *
FROM `register`
WHERE `sub_course` = '6'
---
public function getusercount3()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '6')
        ->get()
        ->getResult(); // Change getRow() to getResult()

SELECT *
FROM `register`
WHERE `sub_course` = '7'
---
public function getusercount4()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '7')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `sub_course` = '8'
---
public function getusercount5()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '8')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `course` = '3'
---
public function getusercount6()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('course', '3')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `course` = '3'
---
public function getusercount7()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('course', '3')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `course` = '2'
---
public function getusercount8()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('course', '2')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `sub_course` = '17'
---
public function getusercount9()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '17')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `sub_course` = '19'
---
public function getusercount10()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('sub_course', '19')
        ->get()
        ->getResult();

SELECT *
FROM `register`
WHERE `course` = '3'
---
public function getusercount11()
{
 $countdata = 0;
    $allData = $this->db->table('register')
        ->where('course', '3')
        ->get()
        ->getResult();